{
  "backend/main.mo": "Motoko actor that generates a synthetic 500-patient heart disease dataset and exposes query functions for filtered/all patient retrieval, dataset statistics, and configuration, with filtering by age, gender, race, diabetes, and stroke history.",
  "feature_evidence.json": "Feature evidence report linking a single high-confidence feature (fixing empty dashboard charts by correcting data loading, actor initialization, and React Query hooks) to its affected files and test ID REQ-11.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the project's React components, hooks, pages, and styles.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the TypeScript entry point via a module script tag.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with three routes (Dashboard /, DataStory /story, DataExplorer /explorer) wrapped in a shared Layout component.",
  "frontend/src/components/ChartCard.tsx": "Reusable shadcn Card wrapper that renders a chart with a title, optional description, and hover shadow transition.",
  "frontend/src/components/charts/AgeVsHeartRateChart.tsx": "A scatter chart comparing age vs. maximum heart rate, splitting patients into heart disease and healthy groups with up to 200 sampled points.",
  "frontend/src/components/charts/AnginaByGenderChart.tsx": "A bar chart showing the percentage of exercise-induced angina cases broken down by gender (Male/Female).",
  "frontend/src/components/charts/ChestPainDistributionChart.tsx": "A pie chart displaying the distribution of patients across four chest pain types with percentage labels.",
  "frontend/src/components/charts/CholesterolByAgeChart.tsx": "A bar chart showing average cholesterol levels grouped by decade-based age bins.",
  "frontend/src/components/charts/CholesterolVsBPChart.tsx": "A scatter chart plotting cholesterol against resting blood pressure for up to 200 sampled patients.",
  "frontend/src/components/charts/ComorbidityRatesChart.tsx": "A bar chart showing the rates of diabetes, stroke history, and both conditions among patients diagnosed with heart disease.",
  "frontend/src/components/charts/HeartDiseaseByAgeChart.tsx": "A bar chart displaying heart disease prevalence percentage per decade age group, coloring bars red when prevalence reaches 40% or above.",
  "frontend/src/components/charts/HeartDiseaseByGenderChart.tsx": "A bar chart comparing heart disease prevalence percentages between male and female patients.",
  "frontend/src/components/charts/HeartDiseaseByRaceChart.tsx": "A bar chart showing heart disease prevalence percentage broken down by patient race using teal color shades.",
  "frontend/src/components/charts/ThalassemiaDistributionChart.tsx": "Renders a pie chart showing the distribution of thalassemia types (normal, fixed defect, reversible defect) among a filtered list of patients using Recharts.",
  "frontend/src/components/FilterPanel.tsx": "Interactive filter panel with an age-range slider, gender/race pill buttons, and diabetes/stroke toggles; uses the ageRange tuple from FilterState and shows an active-filter count badge.",
  "frontend/src/components/Layout.tsx": "Persistent app shell with a sticky header containing the HeartInsight logo and three navigation links (Dashboard, Data Story, Data Explorer), a main content slot, and a branded footer.",
  "frontend/src/components/Pagination.tsx": "A reusable pagination control component that displays page numbers with ellipsis, previous/next buttons, and a record count summary, hiding itself when there is only one page.",
  "frontend/src/components/PatientTable.tsx": "A sortable data table component that renders patient records across 17 columns with formatted cell values, sort direction icons, and conditional styling for boolean health fields.",
  "frontend/src/components/StoryScene.tsx": "A presentational component that wraps a chart with a numbered scene header, title, description, and styled card container for data storytelling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (useFilteredPatients, useAllPatients, useDatasetConfig, useDatasetSize) that fetch patient data and configuration from the ICP backend actor with filter support.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind directives, and defines CSS custom properties for a healthcare-themed color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying a hero banner, summary stats, a filter panel, and a grid of chart cards visualizing heart disease data for filtered patients.",
  "frontend/src/pages/DataExplorer.tsx": "Data Explorer page that displays all patient records in a searchable, sortable, paginated table with error handling and loading skeletons.",
  "frontend/src/pages/DataStory.tsx": "A paginated narrative page that walks users through 7 sequential data story scenes, each combining a descriptive title/text with a focused chart component rendered from patient data fetched via a custom hook.",
  "frontend/src/pages/PlatformInfo.tsx": "An empty page component file with no content currently implemented.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Inter, Sora), an extended color palette (teal, crimson, chart colors, sidebar tokens using OKLCH), border radii, box shadows, and animation keyframes for the healthcare-themed app.",
  "project_state.json": "Project state metadata (version 11) describing the Heart Disease Analysis React/TypeScript app, its implemented features (dashboard, charts, data story, data explorer, theming), architectural notes, and a known issue with dashboard data not loading."
}